package planes_schedule;

/** ТЗ

 1. Напишите приложение.
 Программа фиксирует время вылета самолетов из аэропорта.
 Вылет может состояться вовремя, произойти позже или раньше (например, из-за изменения полетного расписания).
 Входные данные программе задаются в формате  <часы:минуты> для каждой из сущностей:
 - время вылета самолета по расписанию
 - время фактического вылета самолета
 Оба параметра являются обязательными. Не вылететь самолет не может.
 Самолет не может вылететь раньше или позже более чем на двенадцать часов.

 Выходные данные программы должны представлять из себя строки вида:
 - «Вылет самолета задержан на <чч:мм>»
 - «Самолет вылетел раньше на <чч:мм>»
 - «Самолет вылетел по расписанию в <чч:мм>»

 Язык реализации приложения может быть любым из Вашего стека.

 */